Revit 2024 API
MEPNetworkSegmentData Constructor
 Creates a default segment data object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPNetworkSegmentData()
Visual Basic
Public Sub New
Visual C++
public:
MEPNetworkSegmentData()
See Also
MEPNetworkSegmentData Class
MEPNetworkSegmentData Overload
Autodesk.Revit.DB.Analysis Namespace